go_strings.org
#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:{} _:{} -:t f:t *:t <:t todo:t
#+INFOJS_OPT: view:t toc:t ltoc:t mouse:underline buttons:0 path:org-info.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="solarized-dark.css" />
#+HTML_MATHJAX: align: center tagside: left font: Neo-Euler
#+KEYWORDS: Go unicode
#+HTML_LINK_HOME: https://pimiento.github.io/
#+HTML_LINK_UP: https://pimiento.github.io/
#+TITLE: Go: Strings

* String
  Go's *string* type is fundamentally different from the equivalent type in many other languages, where /string/ types are all sequence of *fixexd-with* characters, whereas a Go *string* is a _sequence of *variable-width* characters_ where each character is represented by one or more bytes, normally using UTF-8 encoding.

* literals, operators, escapes
  String literals are created using double quotes *"* or backticks *`*. Double quotes are used to create interpreted string literals, which support the escape sequences but may not span multiple lines. Backticks are used to create raw string literals — these strings may span multiple lines, they do not support any escape sequences and may contain any character except for a backtick.
  #+BEGIN_SRC go :exports both :results output :imports "fmt"
    text := "\"What's that?\", he said" // Interpreted string literal
    text2 := `"What's that?", he said`  // Raw string literal
    radicals := "√ \u221A \U0000221a"   // radicals == "√ √ √"
    fmt.Printf("text = %s\ntext2 = %s\nradicals = %s", text, text2, radicals)
  #+END_SRC

  #+RESULTS:
  : text = "What's that?", he said
  : text2 = "What's that?", he said
  : radicals = √ √ √

  | Syntax             | Description/result                                                                                   |
  |--------------------+------------------------------------------------------------------------------------------------------|
  | /                  | <                                                                                                    |
  |                    | <100>                                                                                                |
  | *s += t*           | Appends string t to the end of string s                                                              |
  | *s + t*            | The concatenation of strings s and t                                                                 |
  | *s[n]*             | The raw byte at index position n (of type uint8 ) in s                                               |
  | *s[n:m]*           | A string taken from s from index positions n to m - 1                                                |
  | *s[n:]*            | A string taken from s from index positions n to len(s) - 1                                           |
  | *s[:m]*            | A string taken from s from index positions 0 to m - 1                                                |
  | *len(s)*           | The number of bytes in string s                                                                      |
  | *len([]rune(s))*   | The number of characters in string s —use the faster utf8. RuneCountInString() instead;              |
  | *[]rune(s)*        | Converts string s into a slice of Unicode code points                                                |
  | *string(chars)*    | Converts a []rune or []int32 into a string ; assumes that the rune s or int32 s are Unicode code points |
  | *[]byte(s)*        | Converts string s into a slice of raw bytes without copying; there’s no guarantee that the bytes are valid UTF-8 |
  | *string(bytes)*    | Converts a []byte or []uint8 into a string without copying; there’s no guarantee that the bytes are valid UTF-8 |
  | *string(i)*        | Converts i of any integer type into a string ; assumes that iis a Unicode code point; e.g., if i is 65 , it returns "A" |
  | *strconv.Itoa(i)*  | The string representation of i of type int and an error ; e.g., if i is 65 , it returns ( "65" , nil ); |
  | *fmt.Sprintx*      | The string representation of x of any type; e.g., if x is an integer of value 65 , it returns "65" ; |

* Comparing strings
  Go strings support the usual comparison operators: $<$, $<=$, $==$, $!=$, $>=$, $>$. The comparison operators compare strings byte by byte in memory. Three problems can arise when performing comparisons:
  1. Some Unicode characters can be represented by two or more different byte sequences. For example, the character *Å* could be the /Ångström/ symbol or simply an A with a ring above /Å/ and can be represented by Unicode code point U+00C5 (Å) or by the two code points U+0041 and U+030A (A and COMBINING RING ABOVE). In terms of UTF-8 bytes symbols are represented with a different byte sequences and it can be different result for comparison and sorting strings with these symbols. It is always possible to write a custom normalization function that, for example, ensured that, say /é/ was always represented by the bytes $[0xC3, 0xA9]$ rather than, say, $[0x65, 0xCC, 0x81]$ (i.e., an /e/ and an combining character). Normalizing Unicode characters is explanet in the [[http://unicode.org/reports/tr15][Unicode Normalization document]].The Go standard library has an /experimental/ normalization package (exp/norm).
  2. The second is that there are cases where our users might reasonably expect /different/ characters to be considered equal. Users might expect a search for $5$ to match $5$, $_{5}$, $^{5}$, and maybe even $➄$. As with the first problem this can be solved by using some form of normalization.
  3. Sorting of some characters is language-specific.

