go_strings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-09 Thu 21:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go: Strings</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Go unicode" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Go: Strings</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbbbb657">1. String</a></li>
<li><a href="#org477669a">2. literals, operators, escapes</a></li>
<li><a href="#orgaab3eaf">3. Comparing strings</a></li>
<li><a href="#orgfe49d28">4. Characters and strings</a></li>
<li><a href="#orge63c9ab">5. Indexing and slicing strings</a></li>
<li><a href="#orgb507103">6. String formatting with the fmt package</a>
<ul>
<li><a href="#org6babb0c">6.1. Formatting booleans</a></li>
<li><a href="#orge6b5984">6.2. Formatting integers</a></li>
<li><a href="#org8ebe5e9">6.3. Formatting characters</a></li>
<li><a href="#orgdd58c60">6.4. Formatting floating-point numbers</a></li>
<li><a href="#org79669df">6.5. Formatting strings and slices</a></li>
<li><a href="#org3061bf0">6.6. Formatting for debuging</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbbbb657" class="outline-2">
<h2 id="orgbbbb657"><span class="section-number-2">1</span> String</h2>
<div class="outline-text-2" id="text-1">
<p>
Go's <b>string</b> type is fundamentally different from the equivalent type in many other languages, where <i>string</i> types are all sequence of <b>fixexd-with</b> characters, whereas a Go <b>string</b> is a <span class="underline">sequence of <b>variable-width</b> characters</span> where each character is represented by one or more bytes, normally using UTF-8 encoding.
</p>
</div>
</div>

<div id="outline-container-org477669a" class="outline-2">
<h2 id="org477669a"><span class="section-number-2">2</span> literals, operators, escapes</h2>
<div class="outline-text-2" id="text-2">
<p>
String literals are created using double quotes <b>"</b> or backticks <b>`</b>. Double quotes are used to create interpreted string literals, which support the escape sequences but may not span multiple lines. Backticks are used to create raw string literals — these strings may span multiple lines, they do not support any escape sequences and may contain any character except for a backtick.
</p>
<div class="org-src-container">
<pre class="src src-go">text := <span style="color: #ffa500;">"\"What's that?\", he said"</span> <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Interpreted string literal</span>
text2 := <span style="color: #ffa500;">`"What's that?", he said`</span>  <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Raw string literal</span>
radicals := <span style="color: #ffa500;">"&#8730; \u221A \U0000221a"</span>   <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">radicals == "&#8730; &#8730; &#8730;"</span>
fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"text = %s\ntext2 = %s\nradicals = %s"</span>, text, text2, radicals)
</pre>
</div>

<pre class="example">
text = "What's that?", he said
text2 = "What's that?", he said
radicals = √ √ √

</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Syntax</th>
<th scope="col" class="org-left">Description/result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>s += t</b></td>
<td class="org-left">Appends string t to the end of string s</td>
</tr>

<tr>
<td class="org-left"><b>s + t</b></td>
<td class="org-left">The concatenation of strings s and t</td>
</tr>

<tr>
<td class="org-left"><b>s[n]</b></td>
<td class="org-left">The raw byte at index position n (of type uint8 ) in s</td>
</tr>

<tr>
<td class="org-left"><b>s[n:m]</b></td>
<td class="org-left">A string taken from s from index positions n to m - 1</td>
</tr>

<tr>
<td class="org-left"><b>s[n:]</b></td>
<td class="org-left">A string taken from s from index positions n to len(s) - 1</td>
</tr>

<tr>
<td class="org-left"><b>s[:m]</b></td>
<td class="org-left">A string taken from s from index positions 0 to m - 1</td>
</tr>

<tr>
<td class="org-left"><b>len(s)</b></td>
<td class="org-left">The number of bytes in string s</td>
</tr>

<tr>
<td class="org-left"><b>len([]rune(s))</b></td>
<td class="org-left">The number of characters in string s —use the faster utf8. RuneCountInString() instead;</td>
</tr>

<tr>
<td class="org-left"><b>[]rune(s)</b></td>
<td class="org-left">Converts string s into a slice of Unicode code points</td>
</tr>

<tr>
<td class="org-left"><b>string(chars)</b></td>
<td class="org-left">Converts a []rune or []int32 into a string ; assumes that the rune s or int32 s are Unicode code points</td>
</tr>

<tr>
<td class="org-left"><b>[]byte(s)</b></td>
<td class="org-left">Converts string s into a slice of raw bytes without copying; there’s no guarantee that the bytes are valid UTF-8</td>
</tr>

<tr>
<td class="org-left"><b>string(bytes)</b></td>
<td class="org-left">Converts a []byte or []uint8 into a string without copying; there’s no guarantee that the bytes are valid UTF-8</td>
</tr>

<tr>
<td class="org-left"><b>string(i)</b></td>
<td class="org-left">Converts i of any integer type into a string ; assumes that iis a Unicode code point; e.g., if i is 65 , it returns "A"</td>
</tr>

<tr>
<td class="org-left"><b>strconv. Itoa(i)</b></td>
<td class="org-left">The string representation of i of type int and an error ; e.g., if i is 65 , it returns ( "65" , nil );</td>
</tr>

<tr>
<td class="org-left"><b>fmt.Sprintx</b></td>
<td class="org-left">The string representation of x of any type; e.g., if x is an integer of value 65 , it returns "65" ;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgaab3eaf" class="outline-2">
<h2 id="orgaab3eaf"><span class="section-number-2">3</span> Comparing strings</h2>
<div class="outline-text-2" id="text-3">
<p>
Go strings support the usual comparison operators: \(<\), \(<=\), \(==\), \(!=\), \(>=\), \(>\). The comparison operators compare strings byte by byte in memory. Three problems can arise when performing comparisons:
</p>
<ol class="org-ol">
<li>Some Unicode characters can be represented by two or more different byte sequences. For example, the character <b>Å</b> could be the <i>Ångström</i> symbol or simply an A with a ring above <i>Å</i> and can be represented by Unicode code point U+00C5 (Å) or by the two code points U+0041 and U+030A (A and COMBINING RING ABOVE). In terms of UTF-8 bytes symbols are represented with a different byte sequences and it can be different result for comparison and sorting strings with these symbols. It is always possible to write a custom normalization function that, for example, ensured that, say <i>é</i> was always represented by the bytes \([0xC3, 0xA9]\) rather than, say, \([0x65, 0xCC, 0x81]\) (i.e., an <i>e</i> and an combining character). Normalizing Unicode characters is explanet in the <a href="http://unicode.org/reports/tr15">Unicode Normalization document</a>.The Go standard library has an <i>experimental</i> normalization package (exp/norm).</li>
<li>The second is that there are cases where our users might reasonably expect <i>different</i> characters to be considered equal. Users might expect a search for \(5\) to match \(5\), \(_{5}\), \(^{5}\), and maybe even \(➄\). As with the first problem this can be solved by using some form of normalization.</li>
<li>Sorting of some characters is language-specific.</li>
</ol>
</div>
</div>
