go_strings.org
* Characters and strings
  A single character can be represented by a single *rune* (or int32). Go /strings/ represent sequences of zero or more characters. We can convert a single character into a one-character /string/ using Go's standard conversion syntax:
  #+BEGIN_SRC go :exports both :results output :imports "fmt"
    æs := ""
    for _, char := range []rune{'æ', 0xE6, 0346, 230, '\xE6', '\u00E6'} {
            fmt.Printf("[0x%X '%c']", char, char)
            æs += string(char)
    }
    fmt.Println()
    fmt.Println(æs)
  #+END_SRC

  #+RESULTS:
  : [0xE6 'æ'][0xE6 'æ'][0xE6 'æ'][0xE6 'æ'][0xE6 'æ'][0xE6 'æ']
  : ææææææ
  An entire string can be converted to a slice of /runes/ (i.e. code points) using the syntax *chars := []rune (s)* where *s* is of type *string*. The chars will have type *[]int32* since *rune* is a synonym for *int32*. The reverse conversion is using syntax *s := string(chars)* where *chars* is of type *[]rune* or *[]int32*; *s* will have type *string*. Both conversions are reasonably fast ($O(n)$ where $n$ is the number of bytes)

* Indexing and slicing strings
  Since Go strings store their text as UTF-8 encoded bytes we must be careful to only ever slice on character boundaries. This is easy if we have 7-bit ASCII text since every byte represents one character, but for non-ASCII text the situation is more challenging since such characters may be represented by one or more bytes. Usually we don't need to slice strings at all but simply iterate over them character by character using a *for … range* loop, but in some situations we really do want to extract substrings using slicing. One way to be sure to use slice indexes that slice on character boundaries is to use functions from Go's *strings* packages, such as *strings.Index()* or *strings.LastIndex()*.
  If we really need to index individual characters, a couple of options are open to us. For strings that contain only 7-bit ASCII we can simply use the *[]* index operator which gives us very fast ($O(1)$) lookups. For non-ASCII strings we can convert the string to a *[]rune* and use the *[]* index operator. This delivers very fast ($O(1)$) lookup performance, but at the expense of the one-off conversion which costs both CPU and memory ($O(n)$).
  For arbitrary strings (i.e., those that might contain non-ASCII characters), extracting characters by index is rarely the right apprroach. Much better is to use string slicing — which also has the convenience of returning a *string* rather than a *byte*.
  #+BEGIN_SRC go :exports both :results output :imports '("fmt" "strings")
    line := "røde og gule sløjfer"
    i := strings.Index(line, " ")    // Get the index of the first space
    firstWord := line[:i]            // Slice up to the first space
    j := strings.LastIndex(line, " ") // Get the index of the last space
    lastWord := line[j+1:]           // Slice from after the last space
    fmt.Println(firstWord, lastWord)
  #+END_SRC

  #+RESULTS:
  : røde sløjfer
  Although this example is fine for spaces and would also work for other 7-bit ASCII characters, it isn't suitable for working with arbitrary Unicode whitespace characters such as U+2028 (Line Separator  ) or U+2029 (Paragraph Separator  ).
  #+BEGIN_SRC go :exports both :results output :imports '("fmt" "strings" "unicode" "unicode/utf8")
    line := "rå tørt\u2028vær"
    i := strings.IndexFunc(line, unicode.IsSpace)
    firstWord := line[:i]
    j := strings.LastIndexFunc(line, unicode.IsSpace)
    _, size := utf8.DecodeRuneInString(line[j:])
    lastWord := line[j+size:]
    fmt.Println(firstWord, lastWord)
  #+END_SRC

  #+RESULTS:
  : rå vær

