go_strings.html

<div id="outline-container-orgfe49d28" class="outline-2">
<h2 id="orgfe49d28"><span class="section-number-2">4</span> Characters and strings</h2>
<div class="outline-text-2" id="text-4">
<p>
A single character can be represented by a single <b>rune</b> (or int32). Go <i>strings</i> represent sequences of zero or more characters. We can convert a single character into a one-character <i>string</i> using Go's standard conversion syntax:
</p>
<div class="org-src-container">
<pre class="src src-go">&#230;s := <span style="color: #ffa500;">""</span>
<span style="color: #00ff00; font-weight: bold;">for</span> _, char := <span style="color: #00ff00; font-weight: bold;">range</span> []<span style="color: #00ffff;">rune</span>{<span style="color: #ffa500;">'&#230;'</span>, 0xE6, 0346, 230, <span style="color: #ffa500;">'\xE6'</span>, <span style="color: #ffa500;">'\u00E6'</span>} {
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"[0x%X '%c']"</span>, char, char)
        &#230;s += <span style="color: #00ffff; font-weight: bold;">string</span>(char)
}
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>()
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(&#230;s)
</pre>
</div>

<pre class="example">
[0xE6 'æ'][0xE6 'æ'][0xE6 'æ'][0xE6 'æ'][0xE6 'æ'][0xE6 'æ']
ææææææ

</pre>
<p>
An entire string can be converted to a slice of <i>runes</i> (i.e. code points) using the syntax <b>chars := []rune (s)</b> where <b>s</b> is of type <b>string</b>. The chars will have type <b>[]int32</b> since <b>rune</b> is a synonym for <b>int32</b>. The reverse conversion is using syntax <b>s := string(chars)</b> where <b>chars</b> is of type <b>[]rune</b> or <b>[]int32</b>; <b>s</b> will have type <b>string</b>. Both conversions are reasonably fast (\(O(n)\) where \(n\) is the number of bytes)
</p>
</div>
</div>

<div id="outline-container-orge63c9ab" class="outline-2">
<h2 id="orge63c9ab"><span class="section-number-2">5</span> Indexing and slicing strings</h2>
<div class="outline-text-2" id="text-5">
<p>
Since Go strings store their text as UTF-8 encoded bytes we must be careful to only ever slice on character boundaries. This is easy if we have 7-bit ASCII text since every byte represents one character, but for non-ASCII text the situation is more challenging since such characters may be represented by one or more bytes. Usually we don't need to slice strings at all but simply iterate over them character by character using a <b>for … range</b> loop, but in some situations we really do want to extract substrings using slicing. One way to be sure to use slice indexes that slice on character boundaries is to use functions from Go's <b>strings</b> packages, such as <b>strings.Index()</b> or <b>strings.LastIndex()</b>.
If we really need to index individual characters, a couple of options are open to us. For strings that contain only 7-bit ASCII we can simply use the <b>[]</b> index operator which gives us very fast (\(O(1)\)) lookups. For non-ASCII strings we can convert the string to a <b>[]rune</b> and use the <b>[]</b> index operator. This delivers very fast (\(O(1)\)) lookup performance, but at the expense of the one-off conversion which costs both CPU and memory (\(O(n)\)).
For arbitrary strings (i.e., those that might contain non-ASCII characters), extracting characters by index is rarely the right apprroach. Much better is to use string slicing — which also has the convenience of returning a <b>string</b> rather than a <b>byte</b>.
</p>
<div class="org-src-container">
<pre class="src src-go">line := <span style="color: #ffa500;">"r&#248;de og gule sl&#248;jfer"</span>
i := strings.<span style="color: #00ffff; font-weight: bold;">Index</span>(line, <span style="color: #ffa500;">" "</span>)    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Get the index of the first space</span>
firstWord := line[:i]            <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Slice up to the first space</span>
j := strings.<span style="color: #00ffff; font-weight: bold;">LastIndex</span>(line, <span style="color: #ffa500;">" "</span>) <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Get the index of the last space</span>
lastWord := line[j+1:]           <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Slice from after the last space</span>
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(firstWord, lastWord)
</pre>
</div>

<pre class="example">
røde sløjfer

</pre>
<p>
Although this example is fine for spaces and would also work for other 7-bit ASCII characters, it isn't suitable for working with arbitrary Unicode whitespace characters such as U+2028 (Line Separator  ) or U+2029 (Paragraph Separator  ).
</p>
<div class="org-src-container">
<pre class="src src-go">line := <span style="color: #ffa500;">"r&#229; t&#248;rt\u2028v&#230;r"</span>
i := strings.<span style="color: #00ffff; font-weight: bold;">IndexFunc</span>(line, unicode.IsSpace)
firstWord := line[:i]
j := strings.<span style="color: #00ffff; font-weight: bold;">LastIndexFunc</span>(line, unicode.IsSpace)
_, size := utf8.<span style="color: #00ffff; font-weight: bold;">DecodeRuneInString</span>(line[j:])
lastWord := line[j+size:]
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(firstWord, lastWord)
</pre>
</div>

<pre class="example">
rå vær

</pre>
</div>
</div>
