go_strings.org
* String formatting with the fmt package
  Go's standard library's *fmt* package provides print functions for writing data as strings to the console, to files and other values satisfying the *io.Writer* interface, and to other strings. The *fmt* package also provides various /scan/ functions for reading data from the console, from the files, and from strings.

  #+CAPTION: fmt print functions
  | Syntax                                 | Description/result                                                               |
  |----------------------------------------+----------------------------------------------------------------------------------|
  | /                                      | <                                                                                |
  |                                        | <80>                                                                             |
  | *fmt.Errorf(format, args...)*       | Returns an error value containing a string created with the /format/ string and the /args/ |
  | *fmt.Fprint(writer, args...)*          | Writes the /args/ to the /writer/ each using format %v and space-separating nonstrings; returns the number of bytes written, and an /error/ or /nil/ |
  | *fmt.Fprintf(writer, format, args...)* | Writes the /args/ to the /writer/ using the /format/ string; returns the number of bytes written, and an /error/ or /nil/ |
  | *fmt.Fprintln(writer, args...)*        | Writes the /args/ to the writer each using format %v, space-separated and ending with a newline; returns the number of bytes written, and an /error/ or /nil/ |
  | *fmt.Print(args...)*                   | Write the /args/ to /os.Stdout/ each using format %v and space-separating nonstrings; return the number of bytes written, and an /error/ or /nil/ |
  | *fmt.Printf(format, args...)*          | Writes the /args/ to /os.Stdout/ using the /format/ string; returns the number of bytes written, and an /error/ or /nil/ |
  | *fmt.Println(args...)*                 | Writes the /args/ to /os.Stdout/ each using format %v , spaceseparated and ending with a newline; returns the number of bytes written, and an /error/ or /nil/ |
  | *fmt.Sprint(args...)*                  | Returns a string of the /args/ , each formatted using format %v and space-separating nonstrings |
  | *fmt.Sprintf(format, args...)*         | Returns a string of the /args/ formatted using the /format/ string               |
  | *fmt.Sprintln(args...)*                | Returns a string of the /args/ , each formatted using format %v , space-separated and ending with a newline |
-----
  #+CAPTION: fmt verbs
  | Verb | Description/result                                                               |
  |------+----------------------------------------------------------------------------------|
  | /    | <                                                                                |
  |      | <90>                                                                             |
  | *%%* | A literal % character                                                            |
  | *%b* | An integer value as a binary (base 2) number, or (advanced) a ﬂoating-point number in scientiﬁc notation with a power of 2 exponent |
  | *%c* | An integer code point value as a Unicode character                               |
  | *%d* | An integer value as a decimal (base 10) number                                   |
  | *%e* | A ﬂoating-point or complex value in scientiﬁc notation with e                    |
  | *%E* | A ﬂoating-point or complex value in scientiﬁc notation with E                    |
  | *%f* | A ﬂoating-point or complex value in standard notation                            |
  | *%g* | A ﬂoating-point or complex value using %e or %f , whichever produces the most compact output |
  | *%G* | A ﬂoating-point or complex value using %E or %f , whichever produces the most compact output |
  | *%o* | An integer value as an octal (base 8) number                                     |
  | *%p* | A value’s address as a hexadecimal (base 16) number with a preﬁx of 0x and using lowercase for the digits a – f (for debugging) |
  | *%q* | The string or []byte as a double-quoted string, or the integer as a single-quoted string, using Go syntax and using escapes where necessary |
  | *%s* | The string or []byte as raw UTF-8 bytes; this will produce correct Unicode output for a text ﬁle or on a UTF-8-savvy console |
  | *%t* | A bool value as true or false                                                    |
  | *%T* | A value’s type using Go syntax                                                   |
  | *%U* | An integer code point value using Unicode notation defaulting to four digits; e.g., fmt.Printf("%U", '¶' ) outputs U+00B6 |
  | *%v* | A built-in or custom type’s value using a default format, or a custom value using its type’s String() method if it exists |
  | *%x* | An integer value as a hexadecimal (base 16) number or a string or []byte value as hexadecimal digits (two per byte), using lowercase for the digits a – f |
  | *%X* | An integer value as a hexadecimal (base 16) number or a string or []byte value as hexadecimal digits (two per byte), using uppercase for the digits A – F |
-----
  #+CAPTION: fmt verb modifiers
  | Modiﬁer        | Description/result                                                                         |
  |----------------+--------------------------------------------------------------------------------------------|
  | /              | <                                                                                          |
  |                | <90>                                                                                       |
  | *space*        | Makes the verb output “ - ” before negative numbers and a space before positive numbers or to put spaces between the bytes printed when using the %x or %X verbs; e.g., fmt.Printf("% X", "←" ) outputs E2 86 92 |
  |----------------+--------------------------------------------------------------------------------------------|
  | *#*            | Makes the verb use an “alternative” output format:                                         |
  |                | %#o outputs octal with a leading 0                                                         |
  |                | %#p outputs a pointer without the leading 0x                                               |
  |                | %#q outputs a string or []byte as a raw string (using backticks) if possible—otherwise outputs a double-quoted string |
  |                | %#v outputs a value as itself using Go syntax                                              |
  |                | %#x outputs hexadecimal with a leading 0x                                                  |
  |                | %#X outputs hexadecimal with a leading 0X                                                  |
  |----------------+--------------------------------------------------------------------------------------------|
  | *+*            | Makes the verb output + or - for numbers, ASCII characters (with others escaped) for strings, and ﬁeld names for structs |
  |----------------+--------------------------------------------------------------------------------------------|
  | *-*            | Makes the verb left-justify the value (the default is to right-justify)                    |
  |----------------+--------------------------------------------------------------------------------------------|
  | *0*            | Makes the verb pad with leading 0 s instead of spaces                                      |
  |----------------+--------------------------------------------------------------------------------------------|
  | *n.m* *n* *.m* | For numbers, makes the verb output a ﬂoating-point or complex value using n (of type int ) characters (or more if necessary to avoid truncation) and with m (of type int ) digits after the decimal point(s). For strings n speciﬁes the minimum ﬁeld width, and will result in space padding if the string has too few characters, and .m speciﬁes the maximum number of the string’s characters to use (going from left to right), and will result in the string being truncated if it is too long. Either or both of m and n can be replaced with * in which case their values are taken from the arguments. Either n or .m may be omitted. |
  #+BEGIN_SRC go :expotrs both :results output :imports "fmt"
    type polar struct{ radius, θ float64 }

    p := polar{8.32, .49}
    fmt.Print(-18.5, 17, "Elephant", -8+.7i, 0x3C7, '\u03C7', "a", "b", p)
    fmt.Println()
    fmt.Println(-18.5, 17, "Elephant", -8+.7i, 0x3C7, '\u03C7', "a", "b", p)
  #+END_SRC

  #+RESULTS:
  : -18.5 17Elephant(-8+0.7i) 967 967ab{8.32 0.49}
  : -18.5 17 Elephant (-8+0.7i) 967 967 a b {8.32 0.49}

