go_strings.html

<div id="outline-container-orgb507103" class="outline-2">
<h2 id="orgb507103"><span class="section-number-2">6</span> String formatting with the fmt package</h2>
<div class="outline-text-2" id="text-6">
<p>
Go's standard library's <b>fmt</b> package provides print functions for writing data as strings to the console, to files and other values satisfying the <b>io.Writer</b> interface, and to other strings. The <b>fmt</b> package also provides various <i>scan</i> functions for reading data from the console, from the files, and from strings.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> fmt print functions</caption>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Syntax</th>
<th scope="col" class="org-left">Description/result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>fmt.Errorf(format, args&#x2026;)</b></td>
<td class="org-left">Returns an error value containing a string created with the <i>format</i> string and the <i>args</i></td>
</tr>

<tr>
<td class="org-left"><b>fmt.Fprint(writer, args&#x2026;)</b></td>
<td class="org-left">Writes the <i>args</i> to the <i>writer</i> each using format %v and space-separating nonstrings; returns the number of bytes written, and an <i>error</i> or <i>nil</i></td>
</tr>

<tr>
<td class="org-left"><b>fmt.Fprintf(writer, format, args&#x2026;)</b></td>
<td class="org-left">Writes the <i>args</i> to the <i>writer</i> using the <i>format</i> string; returns the number of bytes written, and an <i>error</i> or <i>nil</i></td>
</tr>

<tr>
<td class="org-left"><b>fmt.Fprintln(writer, args&#x2026;)</b></td>
<td class="org-left">Writes the <i>args</i> to the writer each using format %v, space-separated and ending with a newline; returns the number of bytes written, and an <i>error</i> or <i>nil</i></td>
</tr>

<tr>
<td class="org-left"><b>fmt.Print(args&#x2026;)</b></td>
<td class="org-left">Write the <i>args</i> to <i>os.Stdout</i> each using format %v and space-separating nonstrings; return the number of bytes written, and an <i>error</i> or <i>nil</i></td>
</tr>

<tr>
<td class="org-left"><b>fmt.Printf(format, args&#x2026;)</b></td>
<td class="org-left">Writes the <i>args</i> to <i>os.Stdout</i> using the <i>format</i> string; returns the number of bytes written, and an <i>error</i> or <i>nil</i></td>
</tr>

<tr>
<td class="org-left"><b>fmt.Println(args&#x2026;)</b></td>
<td class="org-left">Writes the <i>args</i> to <i>os.Stdout</i> each using format %v , spaceseparated and ending with a newline; returns the number of bytes written, and an <i>error</i> or <i>nil</i></td>
</tr>

<tr>
<td class="org-left"><b>fmt.Sprint(args&#x2026;)</b></td>
<td class="org-left">Returns a string of the <i>args</i> , each formatted using format %v and space-separating nonstrings</td>
</tr>

<tr>
<td class="org-left"><b>fmt.Sprintf(format, args&#x2026;)</b></td>
<td class="org-left">Returns a string of the <i>args</i> formatted using the <i>format</i> string</td>
</tr>

<tr>
<td class="org-left"><b>fmt.Sprintln(args&#x2026;)</b></td>
<td class="org-left">Returns a string of the <i>args</i> , each formatted using format %v , space-separated and ending with a newline</td>
</tr>
</tbody>
</table>
<hr />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> fmt verbs</caption>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Verb</th>
<th scope="col" class="org-left">Description/result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>%%</b></td>
<td class="org-left">A literal % character</td>
</tr>

<tr>
<td class="org-left"><b>%b</b></td>
<td class="org-left">An integer value as a binary (base 2) number, or (advanced) a ﬂoating-point number in scientiﬁc notation with a power of 2 exponent</td>
</tr>

<tr>
<td class="org-left"><b>%c</b></td>
<td class="org-left">An integer code point value as a Unicode character</td>
</tr>

<tr>
<td class="org-left"><b>%d</b></td>
<td class="org-left">An integer value as a decimal (base 10) number</td>
</tr>

<tr>
<td class="org-left"><b>%e</b></td>
<td class="org-left">A ﬂoating-point or complex value in scientiﬁc notation with e</td>
</tr>

<tr>
<td class="org-left"><b>%E</b></td>
<td class="org-left">A ﬂoating-point or complex value in scientiﬁc notation with E</td>
</tr>

<tr>
<td class="org-left"><b>%f</b></td>
<td class="org-left">A ﬂoating-point or complex value in standard notation</td>
</tr>

<tr>
<td class="org-left"><b>%g</b></td>
<td class="org-left">A ﬂoating-point or complex value using %e or %f , whichever produces the most compact output</td>
</tr>

<tr>
<td class="org-left"><b>%G</b></td>
<td class="org-left">A ﬂoating-point or complex value using %E or %f , whichever produces the most compact output</td>
</tr>

<tr>
<td class="org-left"><b>%o</b></td>
<td class="org-left">An integer value as an octal (base 8) number</td>
</tr>

<tr>
<td class="org-left"><b>%p</b></td>
<td class="org-left">A value’s address as a hexadecimal (base 16) number with a preﬁx of 0x and using lowercase for the digits a – f (for debugging)</td>
</tr>

<tr>
<td class="org-left"><b>%q</b></td>
<td class="org-left">The string or []byte as a double-quoted string, or the integer as a single-quoted string, using Go syntax and using escapes where necessary</td>
</tr>

<tr>
<td class="org-left"><b>%s</b></td>
<td class="org-left">The string or []byte as raw UTF-8 bytes; this will produce correct Unicode output for a text ﬁle or on a UTF-8-savvy console</td>
</tr>

<tr>
<td class="org-left"><b>%t</b></td>
<td class="org-left">A bool value as true or false</td>
</tr>

<tr>
<td class="org-left"><b>%T</b></td>
<td class="org-left">A value’s type using Go syntax</td>
</tr>

<tr>
<td class="org-left"><b>%U</b></td>
<td class="org-left">An integer code point value using Unicode notation defaulting to four digits; e.g., fmt.Printf("%U", '¶' ) outputs U+00B6</td>
</tr>

<tr>
<td class="org-left"><b>%v</b></td>
<td class="org-left">A built-in or custom type’s value using a default format, or a custom value using its type’s String() method if it exists</td>
</tr>

<tr>
<td class="org-left"><b>%x</b></td>
<td class="org-left">An integer value as a hexadecimal (base 16) number or a string or []byte value as hexadecimal digits (two per byte), using lowercase for the digits a – f</td>
</tr>

<tr>
<td class="org-left"><b>%X</b></td>
<td class="org-left">An integer value as a hexadecimal (base 16) number or a string or []byte value as hexadecimal digits (two per byte), using uppercase for the digits A – F</td>
</tr>
</tbody>
</table>
<hr />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> fmt verb modifiers</caption>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Modiﬁer</th>
<th scope="col" class="org-left">Description/result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>space</b></td>
<td class="org-left">Makes the verb output “ - ” before negative numbers and a space before positive numbers or to put spaces between the bytes printed when using the %x or %X verbs; e.g., fmt.Printf("% X", "←" ) outputs E2 86 92</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>#</b></td>
<td class="org-left">Makes the verb use an “alternative” output format:</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">%#o outputs octal with a leading 0</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">%#p outputs a pointer without the leading 0x</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">%#q outputs a string or []byte as a raw string (using backticks) if possible—otherwise outputs a double-quoted string</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">%#v outputs a value as itself using Go syntax</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">%#x outputs hexadecimal with a leading 0x</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">%#X outputs hexadecimal with a leading 0X</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>+</b></td>
<td class="org-left">Makes the verb output + or - for numbers, ASCII characters (with others escaped) for strings, and ﬁeld names for structs</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>-</b></td>
<td class="org-left">Makes the verb left-justify the value (the default is to right-justify)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>0</b></td>
<td class="org-left">Makes the verb pad with leading 0 s instead of spaces</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>n.m</b> <b>n</b> <b>.m</b></td>
<td class="org-left">For numbers, makes the verb output a ﬂoating-point or complex value using n (of type int ) characters (or more if necessary to avoid truncation) and with m (of type int ) digits after the decimal point(s). For strings n speciﬁes the minimum ﬁeld width, and will result in space padding if the string has too few characters, and .m speciﬁes the maximum number of the string’s characters to use (going from left to right), and will result in the string being truncated if it is too long. Either or both of m and n can be replaced with * in which case their values are taken from the arguments. Either n or .m may be omitted.</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">polar</span> <span style="color: #00ff00; font-weight: bold;">struct</span>{ radius, &#952; float64 }

p := <span style="color: #00ffff;">polar</span>{8.32, .49}
fmt.<span style="color: #00ffff; font-weight: bold;">Print</span>(-18.5, 17, <span style="color: #ffa500;">"Elephant"</span>, -8+.7i, 0x3C7, <span style="color: #ffa500;">'\u03C7'</span>, <span style="color: #ffa500;">"a"</span>, <span style="color: #ffa500;">"b"</span>, p)
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>()
fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(-18.5, 17, <span style="color: #ffa500;">"Elephant"</span>, -8+.7i, 0x3C7, <span style="color: #ffa500;">'\u03C7'</span>, <span style="color: #ffa500;">"a"</span>, <span style="color: #ffa500;">"b"</span>, p)
</pre>
</div>
</div>
