go_strings.org
** Formatting booleans
   Boolean values are output using the %t (truth value) verb
   #+BEGIN_SRC go :exports both :results output :imports "fmt"
     fmt.Printf("%t %t\n", true, false)
   #+END_SRC

   #+RESULTS:
   : true false
   If we want output booleans as integers we must do the conversion ourselves:
   #+BEGIN_SRC go :exports both :results output
     package main

     import "fmt"

     func IntForBool(b bool) int {
             if b {
                     return 1
             }
             return 0
     }

     func main() {
             fmt.Printf("%d %d\n", IntForBool(true), IntForBool(false))
     }
   #+END_SRC

   #+RESULTS:
   : 1 0

** Formatting integers
   #+CAPTION: Binary formatting
   #+BEGIN_SRC go :exports both :results output :imports "fmt"
     fmt.Printf("|%b|%9b|%-9b|%09b|% 9b|", 37, 37, 37, 37, 37)
   #+END_SRC

   #+RESULTS:
   : |100101|   100101|100101   |000100101|   100101|
   #+CAPTION: Octal formatting
   #+BEGIN_SRC go :exports both :results output :imports "fmt"
     fmt.Printf("|%o|%#o|%# 8o|%#+ 8o|%+08o|", 41, 41, 41, 41, -41)
   #+END_SRC

   #+RESULTS:
   : |51|051|     051|    +051|-0000051|
   #+CAPTION: Hexadecimal formatting
   #+BEGIN_SRC go :exports both :results output :imports "fmt"
     i := 3931
     fmt.Printf("|%x|%X|%8x|%08x|%#04X|0x%04X|", i, i, i ,i, i, i)
   #+END_SRC

   #+RESULTS:
   : |f5b|F5B|     f5b|00000f5b|0X0F5B|0x0F5B|
   #+CAPTION: Decimal formatting
   #+BEGIN_SRC go :exports both :results output :imports "fmt"
     fmt.Printf("|%d|%06d|%+06d|", 569, 569, 569)
   #+END_SRC

   #+RESULTS:
   : |569|000569|+00569|

** Formatting characters
   Go characters are rune s (i.e., int32 s), and they can be output as numbers or as Unicode characters.
   #+CAPTION: Character formatting
   #+BEGIN_SRC go :exports both :results output :imports "fmt"
     fmt.Printf("%d %#04x %U '%c'", 0x3A6, 934, '\u03A6', '\U000003A6')
   #+END_SRC

   #+RESULTS:
   : 934 0x03a6 U+03A6 'Φ'

** Formatting floating-point numbers
   For ﬂoating-point numbers we can specify the overall width, the number of digits after the decimal place—and whether to use standard or scientiﬁc notation.
   #+CAPTION: Floating-point formatting
   #+BEGIN_SRC go :exports both :results output :imports "fmt"
     for _, x := range []float64{-.258, 7194.84, -60897162.0218, 1.500089e-8} {
             fmt.Printf("|%20.5e|%20.5f|\n", x, x,)
     }
   #+END_SRC

   #+RESULTS:
   : |        -2.58000e-01|            -0.25800|
   : |         7.19484e+03|          7194.84000|
   : |        -6.08972e+07|     -60897162.02180|
   : |         1.50009e-08|             0.00000|

** Formatting strings and slices
   Strings can be output with a minimum ﬁeld width (which the print functions will pad with spaces if the string is too short), and with a maximum number of characters (which will result in truncation for any string that’s too long). Strings can be output as Unicode (i.e., characters), or as a sequence of code points (i.e., rune s) or as the UTF-8 bytes that represent them.
   #+NAME: slogan
   #+BEGIN_SRC go :results none :exports none
     slogan := "End Óréttlæti♥"
   #+END_SRC

   #+CAPTION: String formatting
   #+BEGIN_SRC go :results output :exports both :imports '("fmt" "strings") :noweb yes
     <<slogan>>
     fmt.Printf("%s\n%q\n%+q\n%#q\n", slogan, slogan, slogan, slogan)
     s := "Dare to be naïve"
     fmt.Printf("|%22s|%-22s|%10s|\n", s, s, s)
     i := strings.Index(s, "n")
     fmt.Printf("|%.10s|%.*s|%-22.10s|%22.10s|%s|\n", s, i, s, s, s, s)
   #+END_SRC

   #+RESULTS:
   : End Óréttlæti♥
   : "End Óréttlæti♥"
   : "End \u00d3r\u00e9ttl\u00e6ti\u2665"
   : `End Óréttlæti♥`
   : |      Dare to be naïve|Dare to be naïve      |Dare to be naïve|
   : |Dare to be|Dare to be |Dare to be            |            Dare to be|Dare to be naïve|

   #+CAPTION: Slice of chars formatting
   #+BEGIN_SRC go :results output :exports both :imports "fmt" :noweb strip-export
     <<slogan>>
     chars := []rune(slogan)
     fmt.Printf("%x\n%#x\n%#X\n", chars, chars, chars)
   #+END_SRC

   #+RESULTS:
   : [45 6e 64 20 d3 72 e9 74 74 6c e6 74 69 2665]
   : [0x45 0x6e 0x64 0x20 0xd3 0x72 0xe9 0x74 0x74 0x6c 0xe6 0x74 0x69 0x2665]
   : [0X45 0X6E 0X64 0X20 0XD3 0X72 0XE9 0X74 0X74 0X6C 0XE6 0X74 0X69 0X2665]

   #+CAPTION: Slice of bytes formatting
   #+BEGIN_SRC go :results output :exports both :imports "fmt" :noweb strip-export
     <<slogan>>
     bytes := []byte(slogan)
     fmt.Printf("%s\n%x\n%X\n% X\n%v\n", bytes, bytes, bytes, bytes, bytes)
   #+END_SRC

   #+RESULTS:
   : End Óréttlæti♥
   : 456e6420c39372c3a974746cc3a67469e299a5
   : 456E6420C39372C3A974746CC3A67469E299A5
   : 45 6E 64 20 C3 93 72 C3 A9 74 74 6C C3 A6 74 69 E2 99 A5
   : [69 110 100 32 195 147 114 195 169 116 116 108 195 166 116 105 226 153 165]

