go_strings.html

<div id="outline-container-org6babb0c" class="outline-3">
<h3 id="org6babb0c"><span class="section-number-3">6.1</span> Formatting booleans</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Boolean values are output using the %t (truth value) verb
</p>
<div class="org-src-container">
<pre class="src src-go">fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%t %t\n"</span>, <span style="color: #7fffd4;">true</span>, <span style="color: #7fffd4;">false</span>)
</pre>
</div>

<pre class="example">
true false

</pre>
<p>
If we want output booleans as integers we must do the conversion ourselves:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">IntForBool</span>(b <span style="color: #00ffff;">bool</span>) <span style="color: #00ffff;">int</span> {
        <span style="color: #00ff00; font-weight: bold;">if</span> b {
                <span style="color: #00ff00; font-weight: bold;">return</span> 1
        }
        <span style="color: #00ff00; font-weight: bold;">return</span> 0
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%d %d\n"</span>, <span style="color: #00ffff; font-weight: bold;">IntForBool</span>(<span style="color: #7fffd4;">true</span>), <span style="color: #00ffff; font-weight: bold;">IntForBool</span>(<span style="color: #7fffd4;">false</span>))
}
</pre>
</div>

<pre class="example">
1 0

</pre>
</div>
</div>

<div id="outline-container-orge6b5984" class="outline-3">
<h3 id="orge6b5984"><span class="section-number-3">6.2</span> Formatting integers</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Binary formatting</label><pre class="src src-go">fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"|%b|%9b|%-9b|%09b|% 9b|"</span>, 37, 37, 37, 37, 37)
</pre>
</div>

<pre class="example">
|100101|   100101|100101   |000100101|   100101|

</pre>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Octal formatting</label><pre class="src src-go">fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"|%o|%#o|%# 8o|%#+ 8o|%+08o|"</span>, 41, 41, 41, 41, -41)
</pre>
</div>

<pre class="example">
|51|051|     051|    +051|-0000051|

</pre>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Hexadecimal formatting</label><pre class="src src-go">i := 3931
fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"|%x|%X|%8x|%08x|%#04X|0x%04X|"</span>, i, i, i ,i, i, i)
</pre>
</div>

<pre class="example">
|f5b|F5B|     f5b|00000f5b|0X0F5B|0x0F5B|

</pre>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Decimal formatting</label><pre class="src src-go">fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"|%d|%06d|%+06d|"</span>, 569, 569, 569)
</pre>
</div>

<pre class="example">
|569|000569|+00569|

</pre>
</div>
</div>

<div id="outline-container-org8ebe5e9" class="outline-3">
<h3 id="org8ebe5e9"><span class="section-number-3">6.3</span> Formatting characters</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Go characters are rune s (i.e., int32 s), and they can be output as numbers or as Unicode characters.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>Character formatting</label><pre class="src src-go">fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%d %#04x %U '%c'"</span>, 0x3A6, 934, <span style="color: #ffa500;">'\u03A6'</span>, <span style="color: #ffa500;">'\U000003A6'</span>)
</pre>
</div>

<pre class="example">
934 0x03a6 U+03A6 'Φ'

</pre>
</div>
</div>

<div id="outline-container-orgdd58c60" class="outline-3">
<h3 id="orgdd58c60"><span class="section-number-3">6.4</span> Formatting floating-point numbers</h3>
<div class="outline-text-3" id="text-6-4">
<p>
For ﬂoating-point numbers we can specify the overall width, the number of digits after the decimal place—and whether to use standard or scientiﬁc notation.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>Floating-point formatting</label><pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">for</span> _, x := <span style="color: #00ff00; font-weight: bold;">range</span> []<span style="color: #00ffff;">float64</span>{-.258, 7194.84, -60897162.0218, 1.500089e-8} {
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"|%20.5e|%20.5f|\n"</span>, x, x,)
}
</pre>
</div>

<pre class="example">
|        -2.58000e-01|            -0.25800|
|         7.19484e+03|          7194.84000|
|        -6.08972e+07|     -60897162.02180|
|         1.50009e-08|             0.00000|

</pre>
</div>
</div>

<div id="outline-container-org79669df" class="outline-3">
<h3 id="org79669df"><span class="section-number-3">6.5</span> Formatting strings and slices</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Strings can be output with a minimum ﬁeld width (which the print functions will pad with spaces if the string is too short), and with a maximum number of characters (which will result in truncation for any string that’s too long). Strings can be output as Unicode (i.e., characters), or as a sequence of code points (i.e., rune s) or as the UTF-8 bytes that represent them.
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>String formatting</label><pre class="src src-go">slogan := <span style="color: #ffa500;">"End &#211;r&#233;ttl&#230;ti&#9829;"</span>
fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s\n%q\n%+q\n%#q\n"</span>, slogan, slogan, slogan, slogan)
s := <span style="color: #ffa500;">"Dare to be na&#239;ve"</span>
fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"|%22s|%-22s|%10s|\n"</span>, s, s, s)
i := strings.<span style="color: #00ffff; font-weight: bold;">Index</span>(s, <span style="color: #ffa500;">"n"</span>)
fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"|%.10s|%.*s|%-22.10s|%22.10s|%s|\n"</span>, s, i, s, s, s, s)
</pre>
</div>

<pre class="example">
End Óréttlæti♥
"End Óréttlæti♥"
"End \u00d3r\u00e9ttl\u00e6ti\u2665"
`End Óréttlæti♥`
|      Dare to be naïve|Dare to be naïve      |Dare to be naïve|
|Dare to be|Dare to be |Dare to be            |            Dare to be|Dare to be naïve|

</pre>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>Slice of chars formatting</label><pre class="src src-go">chars := []<span style="color: #00ffff; font-weight: bold;">rune</span>(slogan)
fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%x\n%#x\n%#X\n"</span>, chars, chars, chars)
</pre>
</div>

<pre class="example">
[45 6e 64 20 d3 72 e9 74 74 6c e6 74 69 2665]
[0x45 0x6e 0x64 0x20 0xd3 0x72 0xe9 0x74 0x74 0x6c 0xe6 0x74 0x69 0x2665]
[0X45 0X6E 0X64 0X20 0XD3 0X72 0XE9 0X74 0X74 0X6C 0XE6 0X74 0X69 0X2665]

</pre>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>Slice of bytes formatting</label><pre class="src src-go">bytes := []<span style="color: #00ffff; font-weight: bold;">byte</span>(slogan)
fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s\n%x\n%X\n% X\n%v\n"</span>, bytes, bytes, bytes, bytes, bytes)
</pre>
</div>

<pre class="example">
End Óréttlæti♥
456e6420c39372c3a974746cc3a67469e299a5
456E6420C39372C3A974746CC3A67469E299A5
45 6E 64 20 C3 93 72 C3 A9 74 74 6C C3 A6 74 69 E2 99 A5
[69 110 100 32 195 147 114 195 169 116 116 108 195 166 116 105 226 153 165]

</pre>
</div>
</div>
