go_strings.org
** Formatting for debuging
   The %T (type) verb is used to print a built-in or custom value’s type, and the %v verb is used to print a built-in value’s value. In fact, %v can also print the value of custom types, using a default format for types that do not have a String() method deﬁned, or using the type’s String() method if it has one.
   #+CAPTION: Debug formatting
   #+BEGIN_SRC go :results output :exports both :imports '("fmt" "math")
     type polar struct{ radius, θ float64 }

     p := polar{-83.40, 71.60}
     fmt.Printf("|%T|%v|%#v|\n", p, p, p)
     fmt.Printf("|%T|%v|%t|\n", false, false, false)
     fmt.Printf("|%T|%v|%d|\n", 7607, 7607, 7607)
     fmt.Printf("|%T|%v|%f|\n", math.E, math.E, math.E)
     fmt.Printf("|%T|%v|%f|\n", 5+7i, 5+7i, 5+7i)
     s := "Relativity"
     fmt.Printf("|%T|\"%v\"|\"%s\"|%q|\n", s, s, s, s)
   #+END_SRC

   #+RESULTS:
   : |main.polar|{-83.4 71.6}|main.polar{radius:-83.4, θ:71.6}|
   : |bool|false|false|
   : |int|7607|7607|
   : |float64|2.718281828459045|2.718282|
   : |complex128|(5+7i)|(5.000000+7.000000i)|
   : |string|"Relativity"|"Relativity"|"Relativity"|
   #+CAPTION: Pointer formatting
   #+BEGIN_SRC go :exports both :results output :imports "fmt"
     i := 5
     f := -48.3124
     s := "Tomás Bretón"
     fmt.Printf("|%p → %d|%p → %f|%#p → %s|\n", &i, i, &f, f, &s, s)
   #+END_SRC

   #+RESULTS:
   : |0xc82000a350 → 5|0xc82000a358 → -48.312400|c82000a360 → Tomás Bretón|
